#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-YD8BvKERfX6RsWL3

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4f2a114c-9f30-4784-b67b-5aee7a41f19a]
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_cloudfront_response_headers_policy.security_headers_policy: Refreshing state... [id=dbd58526-3795-4dea-a38a-b0d743f4caaf]
data.aws_caller_identity.current: Reading...
aws_s3_bucket.legacy_resume_bucket: Refreshing state... [id=legacy-resume.philward.io]
data.aws_route53_zone.philward_io_zone: Reading...
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_caller_identity.current: Read complete after 0s [id=542829616420]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_iam_policy_document.kms_ksk_policy: Reading...
data.aws_iam_policy_document.kms_ksk_policy: Read complete after 0s [id=3690054669]
aws_kms_key.dnssec_kms_key: Refreshing state... [id=43f31946-1cde-40ab-a194-21839adc741f]
data.aws_route53_zone.philward_io_zone: Read complete after 0s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_key_signing_key.philward_io_ksk: Refreshing state... [id=Z003529526RCV8G5J1PS7,philward_io_KSK]
aws_route53_hosted_zone_dnssec.philward_io_dnssec: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_s3_bucket_public_access_block.resume_bucket_access_block: Refreshing state... [id=resume.philward.io]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_philward.io_A]
aws_route53_record.resume_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.legacy_resume_bucket_policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "legacy_resume_bucket_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::legacy-resume.philward.io/*",
            ]
          + sid       = "PublicReadGetObject"
        }
    }

  # aws_route53_record.legacy_resume_record will be created
  + resource "aws_route53_record" "legacy_resume_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "legacy-resume.philward.io"
      + type            = "A"
      + zone_id         = "Z003529526RCV8G5J1PS7"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_s3_bucket.legacy_resume_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "legacy_resume_bucket" {
      + acl                         = "public-read"
        id                          = "legacy-resume.philward.io"
        tags                        = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.legacy_resume_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "legacy_resume_bucket_policy" {
      + bucket = "resume.philward.io"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.legacy_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "legacy_bucket_website" {
      + bucket           = "legacy-resume.philward.io"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "legacy_index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_object.legacy_resume_bucket_contents["legacy_index.html"] will be created
  + resource "aws_s3_object" "legacy_resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "legacy-resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "7eb8b093e708d23af47866494e892848"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "legacy_index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "legacy-site/legacy_index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.legacy_resume_bucket_contents["resume-fonts-grids.css"] will be created
  + resource "aws_s3_object" "legacy_resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "legacy-resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "bf8429f5be82814a134e822163749628"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "resume-fonts-grids.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "legacy-site/resume-fonts-grids.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.legacy_resume_bucket_contents["resume.css"] will be created
  + resource "aws_s3_object" "legacy_resume_bucket_contents" {
      + acl                    = "private"
      + bucket                 = "legacy-resume.philward.io"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "c43b12e4f042c70d547d932dfecf0062"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "resume.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "legacy-site/resume.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.legacy_resume_bucket,
│   on legacy_resume.tf line 3, in resource "aws_s3_bucket" "legacy_resume_bucket":
│    3:   acl    = "public-read"
│ 
│ Use the aws_s3_bucket_acl resource instead
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*